espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core0_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** INTERRUPT_CORE0_SYS_ICM_INTR_MAP_REG register
 *  SYS_ICM_INTR mapping register
 */
#define INTERRUPT_CORE0_SYS_ICM_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x0)
/** INTERRUPT_CORE0_SYS_ICM_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_SYS_ICM_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_SYS_ICM_INTR_MAP_M  (INTERRUPT_CORE0_SYS_ICM_INTR_MAP_V << INTERRUPT_CORE0_SYS_ICM_INTR_MAP_S)
#define INTERRUPT_CORE0_SYS_ICM_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_SYS_ICM_INTR_MAP_S  0
/** INTERRUPT_CORE0_SYS_ICM_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_SYS_ICM_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_SYS_ICM_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_SYS_ICM_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_SYS_ICM_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_SYS_ICM_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_SYS_ICM_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_AXI_PERF_MON_INTR_MAP_REG register
 *  AXI_PERF_MON_INTR mapping register
 */
#define INTERRUPT_CORE0_AXI_PERF_MON_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x4)
/** INTERRUPT_CORE0_AXI_PERF_MON_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_AXI_PERF_MON_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_AXI_PERF_MON_INTR_MAP_M  (INTERRUPT_CORE0_AXI_PERF_MON_INTR_MAP_V << INTERRUPT_CORE0_AXI_PERF_MON_INTR_MAP_S)
#define INTERRUPT_CORE0_AXI_PERF_MON_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_AXI_PERF_MON_INTR_MAP_S  0
/** INTERRUPT_CORE0_AXI_PERF_MON_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_AXI_PERF_MON_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_AXI_PERF_MON_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_AXI_PERF_MON_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_AXI_PERF_MON_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_AXI_PERF_MON_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_AXI_PERF_MON_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_USB_DEVICE_INTR_MAP_REG register
 *  USB_DEVICE_INTR mapping register
 */
#define INTERRUPT_CORE0_USB_DEVICE_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x8)
/** INTERRUPT_CORE0_USB_DEVICE_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_USB_DEVICE_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_USB_DEVICE_INTR_MAP_M  (INTERRUPT_CORE0_USB_DEVICE_INTR_MAP_V << INTERRUPT_CORE0_USB_DEVICE_INTR_MAP_S)
#define INTERRUPT_CORE0_USB_DEVICE_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_USB_DEVICE_INTR_MAP_S  0
/** INTERRUPT_CORE0_USB_DEVICE_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_USB_DEVICE_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_USB_DEVICE_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_USB_DEVICE_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_USB_DEVICE_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_USB_DEVICE_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_USB_DEVICE_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_SDIO_HOST_INTR_MAP_REG register
 *  SDIO_HOST_INTR mapping register
 */
#define INTERRUPT_CORE0_SDIO_HOST_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xc)
/** INTERRUPT_CORE0_SDIO_HOST_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_SDIO_HOST_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_SDIO_HOST_INTR_MAP_M  (INTERRUPT_CORE0_SDIO_HOST_INTR_MAP_V << INTERRUPT_CORE0_SDIO_HOST_INTR_MAP_S)
#define INTERRUPT_CORE0_SDIO_HOST_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_SDIO_HOST_INTR_MAP_S  0
/** INTERRUPT_CORE0_SDIO_HOST_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_SDIO_HOST_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_SDIO_HOST_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_SDIO_HOST_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_SDIO_HOST_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_SDIO_HOST_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_SDIO_HOST_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_SPI2_INTR_MAP_REG register
 *  SPI2_INTR mapping register
 */
#define INTERRUPT_CORE0_SPI2_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x10)
/** INTERRUPT_CORE0_SPI2_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_SPI2_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_SPI2_INTR_MAP_M  (INTERRUPT_CORE0_SPI2_INTR_MAP_V << INTERRUPT_CORE0_SPI2_INTR_MAP_S)
#define INTERRUPT_CORE0_SPI2_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_SPI2_INTR_MAP_S  0
/** INTERRUPT_CORE0_SPI2_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_SPI2_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_SPI2_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_SPI2_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_SPI2_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_SPI2_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_SPI2_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_SPI3_INTR_MAP_REG register
 *  SPI3_INTR mapping register
 */
#define INTERRUPT_CORE0_SPI3_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x14)
/** INTERRUPT_CORE0_SPI3_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_SPI3_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_SPI3_INTR_MAP_M  (INTERRUPT_CORE0_SPI3_INTR_MAP_V << INTERRUPT_CORE0_SPI3_INTR_MAP_S)
#define INTERRUPT_CORE0_SPI3_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_SPI3_INTR_MAP_S  0
/** INTERRUPT_CORE0_SPI3_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_SPI3_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_SPI3_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_SPI3_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_SPI3_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_SPI3_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_SPI3_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_I2S0_INTR_MAP_REG register
 *  I2S0_INTR mapping register
 */
#define INTERRUPT_CORE0_I2S0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x18)
/** INTERRUPT_CORE0_I2S0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_I2S0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_I2S0_INTR_MAP_M  (INTERRUPT_CORE0_I2S0_INTR_MAP_V << INTERRUPT_CORE0_I2S0_INTR_MAP_S)
#define INTERRUPT_CORE0_I2S0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_I2S0_INTR_MAP_S  0
/** INTERRUPT_CORE0_I2S0_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_I2S0_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_I2S0_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_I2S0_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_I2S0_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_I2S0_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_I2S0_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_I2S1_INTR_MAP_REG register
 *  I2S1_INTR mapping register
 */
#define INTERRUPT_CORE0_I2S1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1c)
/** INTERRUPT_CORE0_I2S1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_I2S1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_I2S1_INTR_MAP_M  (INTERRUPT_CORE0_I2S1_INTR_MAP_V << INTERRUPT_CORE0_I2S1_INTR_MAP_S)
#define INTERRUPT_CORE0_I2S1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_I2S1_INTR_MAP_S  0
/** INTERRUPT_CORE0_I2S1_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_I2S1_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_I2S1_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_I2S1_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_I2S1_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_I2S1_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_I2S1_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_UHCI0_INTR_MAP_REG register
 *  UHCI0_INTR mapping register
 */
#define INTERRUPT_CORE0_UHCI0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x20)
/** INTERRUPT_CORE0_UHCI0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_UHCI0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_UHCI0_INTR_MAP_M  (INTERRUPT_CORE0_UHCI0_INTR_MAP_V << INTERRUPT_CORE0_UHCI0_INTR_MAP_S)
#define INTERRUPT_CORE0_UHCI0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_UHCI0_INTR_MAP_S  0
/** INTERRUPT_CORE0_UHCI0_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_UHCI0_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_UHCI0_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_UHCI0_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_UHCI0_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_UHCI0_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_UHCI0_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_UART0_INTR_MAP_REG register
 *  UART0_INTR mapping register
 */
#define INTERRUPT_CORE0_UART0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x24)
/** INTERRUPT_CORE0_UART0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_UART0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_UART0_INTR_MAP_M  (INTERRUPT_CORE0_UART0_INTR_MAP_V << INTERRUPT_CORE0_UART0_INTR_MAP_S)
#define INTERRUPT_CORE0_UART0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_UART0_INTR_MAP_S  0
/** INTERRUPT_CORE0_UART0_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_UART0_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_UART0_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_UART0_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_UART0_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_UART0_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_UART0_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_UART1_INTR_MAP_REG register
 *  UART1_INTR mapping register
 */
#define INTERRUPT_CORE0_UART1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x28)
/** INTERRUPT_CORE0_UART1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_UART1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_UART1_INTR_MAP_M  (INTERRUPT_CORE0_UART1_INTR_MAP_V << INTERRUPT_CORE0_UART1_INTR_MAP_S)
#define INTERRUPT_CORE0_UART1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_UART1_INTR_MAP_S  0
/** INTERRUPT_CORE0_UART1_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_UART1_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_UART1_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_UART1_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_UART1_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_UART1_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_UART1_INTR_PASS_LEVEL_S  8

