espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core0_reg.h
/** INTERRUPT_CORE0_I2C0_INTR_MAP_REG register
 *  I2C0_INTR mapping register
 */
#define INTERRUPT_CORE0_I2C0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x5c)
/** INTERRUPT_CORE0_I2C0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_I2C0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_I2C0_INTR_MAP_M  (INTERRUPT_CORE0_I2C0_INTR_MAP_V << INTERRUPT_CORE0_I2C0_INTR_MAP_S)
#define INTERRUPT_CORE0_I2C0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_I2C0_INTR_MAP_S  0
/** INTERRUPT_CORE0_I2C0_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_I2C0_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_I2C0_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_I2C0_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_I2C0_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_I2C0_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_I2C0_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_I2C1_INTR_MAP_REG register
 *  I2C1_INTR mapping register
 */
#define INTERRUPT_CORE0_I2C1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x60)
/** INTERRUPT_CORE0_I2C1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_I2C1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_I2C1_INTR_MAP_M  (INTERRUPT_CORE0_I2C1_INTR_MAP_V << INTERRUPT_CORE0_I2C1_INTR_MAP_S)
#define INTERRUPT_CORE0_I2C1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_I2C1_INTR_MAP_S  0
/** INTERRUPT_CORE0_I2C1_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_I2C1_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_I2C1_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_I2C1_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_I2C1_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_I2C1_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_I2C1_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_TIMERGRP0_T0_INTR_MAP_REG register
 *  TIMERGRP0_T0_INTR mapping register
 */
#define INTERRUPT_CORE0_TIMERGRP0_T0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x64)
/** INTERRUPT_CORE0_TIMERGRP0_T0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_TIMERGRP0_T0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_TIMERGRP0_T0_INTR_MAP_M  (INTERRUPT_CORE0_TIMERGRP0_T0_INTR_MAP_V << INTERRUPT_CORE0_TIMERGRP0_T0_INTR_MAP_S)
#define INTERRUPT_CORE0_TIMERGRP0_T0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_TIMERGRP0_T0_INTR_MAP_S  0
/** INTERRUPT_CORE0_TIMERGRP0_T0_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_TIMERGRP0_T0_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_TIMERGRP0_T0_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_TIMERGRP0_T0_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_TIMERGRP0_T0_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_TIMERGRP0_T0_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_TIMERGRP0_T0_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_TIMERGRP0_T1_INTR_MAP_REG register
 *  TIMERGRP0_T1_INTR mapping register
 */
#define INTERRUPT_CORE0_TIMERGRP0_T1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x68)
/** INTERRUPT_CORE0_TIMERGRP0_T1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_TIMERGRP0_T1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_TIMERGRP0_T1_INTR_MAP_M  (INTERRUPT_CORE0_TIMERGRP0_T1_INTR_MAP_V << INTERRUPT_CORE0_TIMERGRP0_T1_INTR_MAP_S)
#define INTERRUPT_CORE0_TIMERGRP0_T1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_TIMERGRP0_T1_INTR_MAP_S  0
/** INTERRUPT_CORE0_TIMERGRP0_T1_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_TIMERGRP0_T1_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_TIMERGRP0_T1_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_TIMERGRP0_T1_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_TIMERGRP0_T1_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_TIMERGRP0_T1_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_TIMERGRP0_T1_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_TIMERGRP0_WDT_INTR_MAP_REG register
 *  TIMERGRP0_WDT_INTR mapping register
 */
#define INTERRUPT_CORE0_TIMERGRP0_WDT_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x6c)
/** INTERRUPT_CORE0_TIMERGRP0_WDT_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_TIMERGRP0_WDT_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_TIMERGRP0_WDT_INTR_MAP_M  (INTERRUPT_CORE0_TIMERGRP0_WDT_INTR_MAP_V << INTERRUPT_CORE0_TIMERGRP0_WDT_INTR_MAP_S)
#define INTERRUPT_CORE0_TIMERGRP0_WDT_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_TIMERGRP0_WDT_INTR_MAP_S  0
/** INTERRUPT_CORE0_TIMERGRP0_WDT_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_TIMERGRP0_WDT_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_TIMERGRP0_WDT_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_TIMERGRP0_WDT_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_TIMERGRP0_WDT_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_TIMERGRP0_WDT_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_TIMERGRP0_WDT_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_TIMERGRP1_T0_INTR_MAP_REG register
 *  TIMERGRP1_T0_INTR mapping register
 */
#define INTERRUPT_CORE0_TIMERGRP1_T0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x70)
/** INTERRUPT_CORE0_TIMERGRP1_T0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_TIMERGRP1_T0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_TIMERGRP1_T0_INTR_MAP_M  (INTERRUPT_CORE0_TIMERGRP1_T0_INTR_MAP_V << INTERRUPT_CORE0_TIMERGRP1_T0_INTR_MAP_S)
#define INTERRUPT_CORE0_TIMERGRP1_T0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_TIMERGRP1_T0_INTR_MAP_S  0
/** INTERRUPT_CORE0_TIMERGRP1_T0_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_TIMERGRP1_T0_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_TIMERGRP1_T0_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_TIMERGRP1_T0_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_TIMERGRP1_T0_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_TIMERGRP1_T0_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_TIMERGRP1_T0_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_TIMERGRP1_T1_INTR_MAP_REG register
 *  TIMERGRP1_T1_INTR mapping register
 */
#define INTERRUPT_CORE0_TIMERGRP1_T1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x74)
/** INTERRUPT_CORE0_TIMERGRP1_T1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_TIMERGRP1_T1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_TIMERGRP1_T1_INTR_MAP_M  (INTERRUPT_CORE0_TIMERGRP1_T1_INTR_MAP_V << INTERRUPT_CORE0_TIMERGRP1_T1_INTR_MAP_S)
#define INTERRUPT_CORE0_TIMERGRP1_T1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_TIMERGRP1_T1_INTR_MAP_S  0
/** INTERRUPT_CORE0_TIMERGRP1_T1_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_TIMERGRP1_T1_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_TIMERGRP1_T1_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_TIMERGRP1_T1_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_TIMERGRP1_T1_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_TIMERGRP1_T1_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_TIMERGRP1_T1_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_TIMERGRP1_WDT_INTR_MAP_REG register
 *  TIMERGRP1_WDT_INTR mapping register
 */
#define INTERRUPT_CORE0_TIMERGRP1_WDT_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x78)
/** INTERRUPT_CORE0_TIMERGRP1_WDT_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_TIMERGRP1_WDT_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_TIMERGRP1_WDT_INTR_MAP_M  (INTERRUPT_CORE0_TIMERGRP1_WDT_INTR_MAP_V << INTERRUPT_CORE0_TIMERGRP1_WDT_INTR_MAP_S)
#define INTERRUPT_CORE0_TIMERGRP1_WDT_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_TIMERGRP1_WDT_INTR_MAP_S  0
/** INTERRUPT_CORE0_TIMERGRP1_WDT_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_TIMERGRP1_WDT_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_TIMERGRP1_WDT_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_TIMERGRP1_WDT_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_TIMERGRP1_WDT_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_TIMERGRP1_WDT_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_TIMERGRP1_WDT_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_LEDC0_INTR_MAP_REG register
 *  LEDC0_INTR mapping register
 */
#define INTERRUPT_CORE0_LEDC0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x7c)
/** INTERRUPT_CORE0_LEDC0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_LEDC0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_LEDC0_INTR_MAP_M  (INTERRUPT_CORE0_LEDC0_INTR_MAP_V << INTERRUPT_CORE0_LEDC0_INTR_MAP_S)
#define INTERRUPT_CORE0_LEDC0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LEDC0_INTR_MAP_S  0
/** INTERRUPT_CORE0_LEDC0_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_LEDC0_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_LEDC0_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_LEDC0_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_LEDC0_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_LEDC0_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_LEDC0_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_LEDC1_INTR_MAP_REG register
 *  LEDC1_INTR mapping register
 */
#define INTERRUPT_CORE0_LEDC1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x80)
/** INTERRUPT_CORE0_LEDC1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_LEDC1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_LEDC1_INTR_MAP_M  (INTERRUPT_CORE0_LEDC1_INTR_MAP_V << INTERRUPT_CORE0_LEDC1_INTR_MAP_S)
#define INTERRUPT_CORE0_LEDC1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LEDC1_INTR_MAP_S  0
/** INTERRUPT_CORE0_LEDC1_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_LEDC1_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_LEDC1_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_LEDC1_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_LEDC1_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_LEDC1_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_LEDC1_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_SYSTIMER_TARGET0_INTR_MAP_REG register
 *  SYSTIMER_TARGET0_INTR mapping register
 */
#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x84)
/** INTERRUPT_CORE0_SYSTIMER_TARGET0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INTR_MAP_M  (INTERRUPT_CORE0_SYSTIMER_TARGET0_INTR_MAP_V << INTERRUPT_CORE0_SYSTIMER_TARGET0_INTR_MAP_S)
#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INTR_MAP_S  0
/** INTERRUPT_CORE0_SYSTIMER_TARGET0_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_SYSTIMER_TARGET0_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_SYSTIMER_TARGET0_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_SYSTIMER_TARGET1_INTR_MAP_REG register
 *  SYSTIMER_TARGET1_INTR mapping register
 */
#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x88)
/** INTERRUPT_CORE0_SYSTIMER_TARGET1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INTR_MAP_M  (INTERRUPT_CORE0_SYSTIMER_TARGET1_INTR_MAP_V << INTERRUPT_CORE0_SYSTIMER_TARGET1_INTR_MAP_S)
#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INTR_MAP_S  0
/** INTERRUPT_CORE0_SYSTIMER_TARGET1_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_SYSTIMER_TARGET1_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_SYSTIMER_TARGET1_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_SYSTIMER_TARGET2_INTR_MAP_REG register
 *  SYSTIMER_TARGET2_INTR mapping register
 */
#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x8c)
/** INTERRUPT_CORE0_SYSTIMER_TARGET2_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INTR_MAP_M  (INTERRUPT_CORE0_SYSTIMER_TARGET2_INTR_MAP_V << INTERRUPT_CORE0_SYSTIMER_TARGET2_INTR_MAP_S)
#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INTR_MAP_S  0
/** INTERRUPT_CORE0_SYSTIMER_TARGET2_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_SYSTIMER_TARGET2_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_SYSTIMER_TARGET2_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_AHB_PDMA_IN_CH0_INTR_MAP_REG register
 *  AHB_PDMA_IN_CH0_INTR mapping register
 */
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x90)
/** INTERRUPT_CORE0_AHB_PDMA_IN_CH0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH0_INTR_MAP_M  (INTERRUPT_CORE0_AHB_PDMA_IN_CH0_INTR_MAP_V << INTERRUPT_CORE0_AHB_PDMA_IN_CH0_INTR_MAP_S)
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH0_INTR_MAP_S  0
/** INTERRUPT_CORE0_AHB_PDMA_IN_CH0_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH0_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH0_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_AHB_PDMA_IN_CH0_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_AHB_PDMA_IN_CH0_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH0_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH0_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_AHB_PDMA_IN_CH1_INTR_MAP_REG register
 *  AHB_PDMA_IN_CH1_INTR mapping register
 */
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x94)
/** INTERRUPT_CORE0_AHB_PDMA_IN_CH1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH1_INTR_MAP_M  (INTERRUPT_CORE0_AHB_PDMA_IN_CH1_INTR_MAP_V << INTERRUPT_CORE0_AHB_PDMA_IN_CH1_INTR_MAP_S)
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH1_INTR_MAP_S  0
/** INTERRUPT_CORE0_AHB_PDMA_IN_CH1_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH1_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH1_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_AHB_PDMA_IN_CH1_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_AHB_PDMA_IN_CH1_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH1_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH1_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_AHB_PDMA_IN_CH2_INTR_MAP_REG register
 *  AHB_PDMA_IN_CH2_INTR mapping register
 */
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH2_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x98)
/** INTERRUPT_CORE0_AHB_PDMA_IN_CH2_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH2_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH2_INTR_MAP_M  (INTERRUPT_CORE0_AHB_PDMA_IN_CH2_INTR_MAP_V << INTERRUPT_CORE0_AHB_PDMA_IN_CH2_INTR_MAP_S)
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH2_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH2_INTR_MAP_S  0
/** INTERRUPT_CORE0_AHB_PDMA_IN_CH2_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH2_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH2_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_AHB_PDMA_IN_CH2_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_AHB_PDMA_IN_CH2_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH2_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH2_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_AHB_PDMA_IN_CH3_INTR_MAP_REG register
 *  AHB_PDMA_IN_CH3_INTR mapping register
 */
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH3_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x9c)
/** INTERRUPT_CORE0_AHB_PDMA_IN_CH3_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH3_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH3_INTR_MAP_M  (INTERRUPT_CORE0_AHB_PDMA_IN_CH3_INTR_MAP_V << INTERRUPT_CORE0_AHB_PDMA_IN_CH3_INTR_MAP_S)
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH3_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH3_INTR_MAP_S  0
/** INTERRUPT_CORE0_AHB_PDMA_IN_CH3_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH3_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH3_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_AHB_PDMA_IN_CH3_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_AHB_PDMA_IN_CH3_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH3_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH3_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_AHB_PDMA_IN_CH4_INTR_MAP_REG register
 *  AHB_PDMA_IN_CH4_INTR mapping register
 */
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH4_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xa0)
/** INTERRUPT_CORE0_AHB_PDMA_IN_CH4_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH4_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH4_INTR_MAP_M  (INTERRUPT_CORE0_AHB_PDMA_IN_CH4_INTR_MAP_V << INTERRUPT_CORE0_AHB_PDMA_IN_CH4_INTR_MAP_S)
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH4_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH4_INTR_MAP_S  0
/** INTERRUPT_CORE0_AHB_PDMA_IN_CH4_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH4_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH4_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_AHB_PDMA_IN_CH4_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_AHB_PDMA_IN_CH4_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH4_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH4_INTR_PASS_LEVEL_S  8

