espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core0_reg.h
/** INTERRUPT_CORE0_ECDSA_INTR_MAP_REG register
 *  ECDSA_INTR mapping register
 */
#define INTERRUPT_CORE0_ECDSA_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xe8)
/** INTERRUPT_CORE0_ECDSA_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_ECDSA_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_ECDSA_INTR_MAP_M  (INTERRUPT_CORE0_ECDSA_INTR_MAP_V << INTERRUPT_CORE0_ECDSA_INTR_MAP_S)
#define INTERRUPT_CORE0_ECDSA_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_ECDSA_INTR_MAP_S  0
/** INTERRUPT_CORE0_ECDSA_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_ECDSA_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_ECDSA_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_ECDSA_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_ECDSA_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_ECDSA_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_ECDSA_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_KM_INTR_MAP_REG register
 *  KM_INTR mapping register
 */
#define INTERRUPT_CORE0_KM_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xec)
/** INTERRUPT_CORE0_KM_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_KM_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_KM_INTR_MAP_M  (INTERRUPT_CORE0_KM_INTR_MAP_V << INTERRUPT_CORE0_KM_INTR_MAP_S)
#define INTERRUPT_CORE0_KM_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_KM_INTR_MAP_S  0
/** INTERRUPT_CORE0_KM_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_KM_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_KM_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_KM_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_KM_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_KM_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_KM_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_RMA_INTR_MAP_REG register
 *  RMA_INTR mapping register
 */
#define INTERRUPT_CORE0_RMA_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xf0)
/** INTERRUPT_CORE0_RMA_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_RMA_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_RMA_INTR_MAP_M  (INTERRUPT_CORE0_RMA_INTR_MAP_V << INTERRUPT_CORE0_RMA_INTR_MAP_S)
#define INTERRUPT_CORE0_RMA_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_RMA_INTR_MAP_S  0
/** INTERRUPT_CORE0_RMA_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_RMA_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_RMA_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_RMA_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_RMA_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_RMA_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_RMA_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_GPIO_INTR0_MAP_REG register
 *  GPIO_INTR0 mapping register
 */
#define INTERRUPT_CORE0_GPIO_INTR0_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xf4)
/** INTERRUPT_CORE0_GPIO_INTR0_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_GPIO_INTR0_MAP    0x0000003FU
#define INTERRUPT_CORE0_GPIO_INTR0_MAP_M  (INTERRUPT_CORE0_GPIO_INTR0_MAP_V << INTERRUPT_CORE0_GPIO_INTR0_MAP_S)
#define INTERRUPT_CORE0_GPIO_INTR0_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_GPIO_INTR0_MAP_S  0
/** INTERRUPT_CORE0_GPIO_INTR0_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_GPIO_INTR0_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_GPIO_INTR0_PASS_LEVEL_M  (INTERRUPT_CORE0_GPIO_INTR0_PASS_LEVEL_V << INTERRUPT_CORE0_GPIO_INTR0_PASS_LEVEL_S)
#define INTERRUPT_CORE0_GPIO_INTR0_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_GPIO_INTR0_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_GPIO_INTR1_MAP_REG register
 *  GPIO_INTR1 mapping register
 */
#define INTERRUPT_CORE0_GPIO_INTR1_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xf8)
/** INTERRUPT_CORE0_GPIO_INTR1_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_GPIO_INTR1_MAP    0x0000003FU
#define INTERRUPT_CORE0_GPIO_INTR1_MAP_M  (INTERRUPT_CORE0_GPIO_INTR1_MAP_V << INTERRUPT_CORE0_GPIO_INTR1_MAP_S)
#define INTERRUPT_CORE0_GPIO_INTR1_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_GPIO_INTR1_MAP_S  0
/** INTERRUPT_CORE0_GPIO_INTR1_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_GPIO_INTR1_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_GPIO_INTR1_PASS_LEVEL_M  (INTERRUPT_CORE0_GPIO_INTR1_PASS_LEVEL_V << INTERRUPT_CORE0_GPIO_INTR1_PASS_LEVEL_S)
#define INTERRUPT_CORE0_GPIO_INTR1_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_GPIO_INTR1_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_GPIO_INTR2_MAP_REG register
 *  GPIO_INTR2 mapping register
 */
#define INTERRUPT_CORE0_GPIO_INTR2_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0xfc)
/** INTERRUPT_CORE0_GPIO_INTR2_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_GPIO_INTR2_MAP    0x0000003FU
#define INTERRUPT_CORE0_GPIO_INTR2_MAP_M  (INTERRUPT_CORE0_GPIO_INTR2_MAP_V << INTERRUPT_CORE0_GPIO_INTR2_MAP_S)
#define INTERRUPT_CORE0_GPIO_INTR2_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_GPIO_INTR2_MAP_S  0
/** INTERRUPT_CORE0_GPIO_INTR2_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_GPIO_INTR2_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_GPIO_INTR2_PASS_LEVEL_M  (INTERRUPT_CORE0_GPIO_INTR2_PASS_LEVEL_V << INTERRUPT_CORE0_GPIO_INTR2_PASS_LEVEL_S)
#define INTERRUPT_CORE0_GPIO_INTR2_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_GPIO_INTR2_PASS_LEVEL_S  8

