espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core0_reg.h
/** INTERRUPT_CORE0_GPIO_INTR3_MAP_REG register
 *  GPIO_INTR3 mapping register
 */
#define INTERRUPT_CORE0_GPIO_INTR3_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x100)
/** INTERRUPT_CORE0_GPIO_INTR3_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_GPIO_INTR3_MAP    0x0000003FU
#define INTERRUPT_CORE0_GPIO_INTR3_MAP_M  (INTERRUPT_CORE0_GPIO_INTR3_MAP_V << INTERRUPT_CORE0_GPIO_INTR3_MAP_S)
#define INTERRUPT_CORE0_GPIO_INTR3_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_GPIO_INTR3_MAP_S  0
/** INTERRUPT_CORE0_GPIO_INTR3_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_GPIO_INTR3_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_GPIO_INTR3_PASS_LEVEL_M  (INTERRUPT_CORE0_GPIO_INTR3_PASS_LEVEL_V << INTERRUPT_CORE0_GPIO_INTR3_PASS_LEVEL_S)
#define INTERRUPT_CORE0_GPIO_INTR3_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_GPIO_INTR3_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_CPU_INTR_FROM_CPU_0_MAP_REG register
 *  CPU_INTR_FROM_CPU_0 mapping register
 */
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_0_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x104)
/** INTERRUPT_CORE0_CPU_INTR_FROM_CPU_0_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_0_MAP    0x0000003FU
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_0_MAP_M  (INTERRUPT_CORE0_CPU_INTR_FROM_CPU_0_MAP_V << INTERRUPT_CORE0_CPU_INTR_FROM_CPU_0_MAP_S)
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_0_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_0_MAP_S  0
/** INTERRUPT_CORE0_CPU_INTR_FROM_CPU_0_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_0_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_0_PASS_LEVEL_M  (INTERRUPT_CORE0_CPU_INTR_FROM_CPU_0_PASS_LEVEL_V << INTERRUPT_CORE0_CPU_INTR_FROM_CPU_0_PASS_LEVEL_S)
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_0_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_0_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_CPU_INTR_FROM_CPU_1_MAP_REG register
 *  CPU_INTR_FROM_CPU_1 mapping register
 */
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_1_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x108)
/** INTERRUPT_CORE0_CPU_INTR_FROM_CPU_1_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_1_MAP    0x0000003FU
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_1_MAP_M  (INTERRUPT_CORE0_CPU_INTR_FROM_CPU_1_MAP_V << INTERRUPT_CORE0_CPU_INTR_FROM_CPU_1_MAP_S)
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_1_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_1_MAP_S  0
/** INTERRUPT_CORE0_CPU_INTR_FROM_CPU_1_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_1_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_1_PASS_LEVEL_M  (INTERRUPT_CORE0_CPU_INTR_FROM_CPU_1_PASS_LEVEL_V << INTERRUPT_CORE0_CPU_INTR_FROM_CPU_1_PASS_LEVEL_S)
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_1_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_1_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_CPU_INTR_FROM_CPU_2_MAP_REG register
 *  CPU_INTR_FROM_CPU_2 mapping register
 */
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_2_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x10c)
/** INTERRUPT_CORE0_CPU_INTR_FROM_CPU_2_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_2_MAP    0x0000003FU
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_2_MAP_M  (INTERRUPT_CORE0_CPU_INTR_FROM_CPU_2_MAP_V << INTERRUPT_CORE0_CPU_INTR_FROM_CPU_2_MAP_S)
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_2_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_2_MAP_S  0
/** INTERRUPT_CORE0_CPU_INTR_FROM_CPU_2_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_2_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_2_PASS_LEVEL_M  (INTERRUPT_CORE0_CPU_INTR_FROM_CPU_2_PASS_LEVEL_V << INTERRUPT_CORE0_CPU_INTR_FROM_CPU_2_PASS_LEVEL_S)
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_2_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_2_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_CPU_INTR_FROM_CPU_3_MAP_REG register
 *  CPU_INTR_FROM_CPU_3 mapping register
 */
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_3_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x110)
/** INTERRUPT_CORE0_CPU_INTR_FROM_CPU_3_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_3_MAP    0x0000003FU
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_3_MAP_M  (INTERRUPT_CORE0_CPU_INTR_FROM_CPU_3_MAP_V << INTERRUPT_CORE0_CPU_INTR_FROM_CPU_3_MAP_S)
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_3_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_3_MAP_S  0
/** INTERRUPT_CORE0_CPU_INTR_FROM_CPU_3_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_3_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_3_PASS_LEVEL_M  (INTERRUPT_CORE0_CPU_INTR_FROM_CPU_3_PASS_LEVEL_V << INTERRUPT_CORE0_CPU_INTR_FROM_CPU_3_PASS_LEVEL_S)
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_3_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_3_PASS_LEVEL_S  8

