espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core0_reg.h
/** INTERRUPT_CORE0_HP_APM_M6_INTR_MAP_REG register
 *  HP_APM_M6_INTR mapping register
 */
#define INTERRUPT_CORE0_HP_APM_M6_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x168)
/** INTERRUPT_CORE0_HP_APM_M6_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_HP_APM_M6_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_HP_APM_M6_INTR_MAP_M  (INTERRUPT_CORE0_HP_APM_M6_INTR_MAP_V << INTERRUPT_CORE0_HP_APM_M6_INTR_MAP_S)
#define INTERRUPT_CORE0_HP_APM_M6_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_HP_APM_M6_INTR_MAP_S  0
/** INTERRUPT_CORE0_HP_APM_M6_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_HP_APM_M6_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_HP_APM_M6_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_HP_APM_M6_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_HP_APM_M6_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_HP_APM_M6_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_HP_APM_M6_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_HP_PERI0_PMS_INTR_MAP_REG register
 *  HP_PERI0_PMS_INTR mapping register
 */
#define INTERRUPT_CORE0_HP_PERI0_PMS_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x16c)
/** INTERRUPT_CORE0_HP_PERI0_PMS_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_HP_PERI0_PMS_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_HP_PERI0_PMS_INTR_MAP_M  (INTERRUPT_CORE0_HP_PERI0_PMS_INTR_MAP_V << INTERRUPT_CORE0_HP_PERI0_PMS_INTR_MAP_S)
#define INTERRUPT_CORE0_HP_PERI0_PMS_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_HP_PERI0_PMS_INTR_MAP_S  0
/** INTERRUPT_CORE0_HP_PERI0_PMS_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_HP_PERI0_PMS_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_HP_PERI0_PMS_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_HP_PERI0_PMS_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_HP_PERI0_PMS_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_HP_PERI0_PMS_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_HP_PERI0_PMS_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_HP_PERI1_PMS_INTR_MAP_REG register
 *  HP_PERI1_PMS_INTR mapping register
 */
#define INTERRUPT_CORE0_HP_PERI1_PMS_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x170)
/** INTERRUPT_CORE0_HP_PERI1_PMS_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_HP_PERI1_PMS_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_HP_PERI1_PMS_INTR_MAP_M  (INTERRUPT_CORE0_HP_PERI1_PMS_INTR_MAP_V << INTERRUPT_CORE0_HP_PERI1_PMS_INTR_MAP_S)
#define INTERRUPT_CORE0_HP_PERI1_PMS_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_HP_PERI1_PMS_INTR_MAP_S  0
/** INTERRUPT_CORE0_HP_PERI1_PMS_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_HP_PERI1_PMS_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_HP_PERI1_PMS_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_HP_PERI1_PMS_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_HP_PERI1_PMS_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_HP_PERI1_PMS_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_HP_PERI1_PMS_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_CPU0_PERI_PMS_INTR_MAP_REG register
 *  CPU0_PERI_PMS_INTR mapping register
 */
#define INTERRUPT_CORE0_CPU0_PERI_PMS_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x174)
/** INTERRUPT_CORE0_CPU0_PERI_PMS_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_CPU0_PERI_PMS_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_CPU0_PERI_PMS_INTR_MAP_M  (INTERRUPT_CORE0_CPU0_PERI_PMS_INTR_MAP_V << INTERRUPT_CORE0_CPU0_PERI_PMS_INTR_MAP_S)
#define INTERRUPT_CORE0_CPU0_PERI_PMS_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_CPU0_PERI_PMS_INTR_MAP_S  0
/** INTERRUPT_CORE0_CPU0_PERI_PMS_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_CPU0_PERI_PMS_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_CPU0_PERI_PMS_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_CPU0_PERI_PMS_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_CPU0_PERI_PMS_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_CPU0_PERI_PMS_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_CPU0_PERI_PMS_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_CPU1_PERI_PMS_INTR_MAP_REG register
 *  CPU1_PERI_PMS_INTR mapping register
 */
#define INTERRUPT_CORE0_CPU1_PERI_PMS_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x178)
/** INTERRUPT_CORE0_CPU1_PERI_PMS_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_CPU1_PERI_PMS_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_CPU1_PERI_PMS_INTR_MAP_M  (INTERRUPT_CORE0_CPU1_PERI_PMS_INTR_MAP_V << INTERRUPT_CORE0_CPU1_PERI_PMS_INTR_MAP_S)
#define INTERRUPT_CORE0_CPU1_PERI_PMS_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_CPU1_PERI_PMS_INTR_MAP_S  0
/** INTERRUPT_CORE0_CPU1_PERI_PMS_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_CPU1_PERI_PMS_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_CPU1_PERI_PMS_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_CPU1_PERI_PMS_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_CPU1_PERI_PMS_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_CPU1_PERI_PMS_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_CPU1_PERI_PMS_INTR_PASS_LEVEL_S  8

