espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core0_reg.h
/** INTERRUPT_CORE0_FLASH_MSPI_INTR_MAP_REG register
 *  FLASH_MSPI_INTR mapping register
 */
#define INTERRUPT_CORE0_FLASH_MSPI_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x17c)
/** INTERRUPT_CORE0_FLASH_MSPI_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_FLASH_MSPI_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_FLASH_MSPI_INTR_MAP_M  (INTERRUPT_CORE0_FLASH_MSPI_INTR_MAP_V << INTERRUPT_CORE0_FLASH_MSPI_INTR_MAP_S)
#define INTERRUPT_CORE0_FLASH_MSPI_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_FLASH_MSPI_INTR_MAP_S  0
/** INTERRUPT_CORE0_FLASH_MSPI_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_FLASH_MSPI_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_FLASH_MSPI_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_FLASH_MSPI_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_FLASH_MSPI_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_FLASH_MSPI_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_FLASH_MSPI_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_LPI_INTR_MAP_REG register
 *  LPI_INTR mapping register
 */
#define INTERRUPT_CORE0_LPI_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x180)
/** INTERRUPT_CORE0_LPI_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_LPI_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_LPI_INTR_MAP_M  (INTERRUPT_CORE0_LPI_INTR_MAP_V << INTERRUPT_CORE0_LPI_INTR_MAP_S)
#define INTERRUPT_CORE0_LPI_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LPI_INTR_MAP_S  0
/** INTERRUPT_CORE0_LPI_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_LPI_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_LPI_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_LPI_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_LPI_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_LPI_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_LPI_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_PMT_INTR_MAP_REG register
 *  PMT_INTR mapping register
 */
#define INTERRUPT_CORE0_PMT_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x184)
/** INTERRUPT_CORE0_PMT_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_PMT_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_PMT_INTR_MAP_M  (INTERRUPT_CORE0_PMT_INTR_MAP_V << INTERRUPT_CORE0_PMT_INTR_MAP_S)
#define INTERRUPT_CORE0_PMT_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_PMT_INTR_MAP_S  0
/** INTERRUPT_CORE0_PMT_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_PMT_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_PMT_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_PMT_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_PMT_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_PMT_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_PMT_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_SBD_INTR_MAP_REG register
 *  SBD_INTR mapping register
 */
#define INTERRUPT_CORE0_SBD_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x188)
/** INTERRUPT_CORE0_SBD_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_SBD_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_SBD_INTR_MAP_M  (INTERRUPT_CORE0_SBD_INTR_MAP_V << INTERRUPT_CORE0_SBD_INTR_MAP_S)
#define INTERRUPT_CORE0_SBD_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_SBD_INTR_MAP_S  0
/** INTERRUPT_CORE0_SBD_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_SBD_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_SBD_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_SBD_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_SBD_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_SBD_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_SBD_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_USB_OTGHS_INTR_MAP_REG register
 *  USB_OTGHS_INTR mapping register
 */
#define INTERRUPT_CORE0_USB_OTGHS_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x18c)
/** INTERRUPT_CORE0_USB_OTGHS_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_USB_OTGHS_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_USB_OTGHS_INTR_MAP_M  (INTERRUPT_CORE0_USB_OTGHS_INTR_MAP_V << INTERRUPT_CORE0_USB_OTGHS_INTR_MAP_S)
#define INTERRUPT_CORE0_USB_OTGHS_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_USB_OTGHS_INTR_MAP_S  0
/** INTERRUPT_CORE0_USB_OTGHS_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_USB_OTGHS_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_USB_OTGHS_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_USB_OTGHS_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_USB_OTGHS_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_USB_OTGHS_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_USB_OTGHS_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_USB_OTGHS_ENDP_MULTI_PROC_INTR_MAP_REG register
 *  USB_OTGHS_ENDP_MULTI_PROC_INTR mapping register
 */
#define INTERRUPT_CORE0_USB_OTGHS_ENDP_MULTI_PROC_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x190)
/** INTERRUPT_CORE0_USB_OTGHS_ENDP_MULTI_PROC_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_USB_OTGHS_ENDP_MULTI_PROC_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_USB_OTGHS_ENDP_MULTI_PROC_INTR_MAP_M  (INTERRUPT_CORE0_USB_OTGHS_ENDP_MULTI_PROC_INTR_MAP_V << INTERRUPT_CORE0_USB_OTGHS_ENDP_MULTI_PROC_INTR_MAP_S)
#define INTERRUPT_CORE0_USB_OTGHS_ENDP_MULTI_PROC_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_USB_OTGHS_ENDP_MULTI_PROC_INTR_MAP_S  0
/** INTERRUPT_CORE0_USB_OTGHS_ENDP_MULTI_PROC_INTR_PASS_LEVEL : R/W; bitpos: [9:8];
 *  default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_USB_OTGHS_ENDP_MULTI_PROC_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_USB_OTGHS_ENDP_MULTI_PROC_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_USB_OTGHS_ENDP_MULTI_PROC_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_USB_OTGHS_ENDP_MULTI_PROC_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_USB_OTGHS_ENDP_MULTI_PROC_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_USB_OTGHS_ENDP_MULTI_PROC_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_JPEG_INTR_MAP_REG register
 *  JPEG_INTR mapping register
 */
#define INTERRUPT_CORE0_JPEG_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x194)
/** INTERRUPT_CORE0_JPEG_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_JPEG_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_JPEG_INTR_MAP_M  (INTERRUPT_CORE0_JPEG_INTR_MAP_V << INTERRUPT_CORE0_JPEG_INTR_MAP_S)
#define INTERRUPT_CORE0_JPEG_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_JPEG_INTR_MAP_S  0
/** INTERRUPT_CORE0_JPEG_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_JPEG_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_JPEG_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_JPEG_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_JPEG_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_JPEG_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_JPEG_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_PPA_INTR_MAP_REG register
 *  PPA_INTR mapping register
 */
#define INTERRUPT_CORE0_PPA_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x198)
/** INTERRUPT_CORE0_PPA_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_PPA_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_PPA_INTR_MAP_M  (INTERRUPT_CORE0_PPA_INTR_MAP_V << INTERRUPT_CORE0_PPA_INTR_MAP_S)
#define INTERRUPT_CORE0_PPA_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_PPA_INTR_MAP_S  0
/** INTERRUPT_CORE0_PPA_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_PPA_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_PPA_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_PPA_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_PPA_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_PPA_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_PPA_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_CORE0_TRACE_INTR_MAP_REG register
 *  CORE0_TRACE_INTR mapping register
 */
#define INTERRUPT_CORE0_CORE0_TRACE_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x19c)
/** INTERRUPT_CORE0_CORE0_TRACE_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_CORE0_TRACE_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_CORE0_TRACE_INTR_MAP_M  (INTERRUPT_CORE0_CORE0_TRACE_INTR_MAP_V << INTERRUPT_CORE0_CORE0_TRACE_INTR_MAP_S)
#define INTERRUPT_CORE0_CORE0_TRACE_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_CORE0_TRACE_INTR_MAP_S  0
/** INTERRUPT_CORE0_CORE0_TRACE_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_CORE0_TRACE_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_CORE0_TRACE_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_CORE0_TRACE_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_CORE0_TRACE_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_CORE0_TRACE_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_CORE0_TRACE_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_CORE1_TRACE_INTR_MAP_REG register
 *  CORE1_TRACE_INTR mapping register
 */
#define INTERRUPT_CORE0_CORE1_TRACE_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1a0)
/** INTERRUPT_CORE0_CORE1_TRACE_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_CORE1_TRACE_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_CORE1_TRACE_INTR_MAP_M  (INTERRUPT_CORE0_CORE1_TRACE_INTR_MAP_V << INTERRUPT_CORE0_CORE1_TRACE_INTR_MAP_S)
#define INTERRUPT_CORE0_CORE1_TRACE_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_CORE1_TRACE_INTR_MAP_S  0
/** INTERRUPT_CORE0_CORE1_TRACE_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_CORE1_TRACE_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_CORE1_TRACE_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_CORE1_TRACE_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_CORE1_TRACE_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_CORE1_TRACE_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_CORE1_TRACE_INTR_PASS_LEVEL_S  8

