espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core0_reg.h
/** INTERRUPT_CORE0_HP_SYSREG_INTR_MAP_REG register
 *  HP_SYSREG_INTR mapping register
 */
#define INTERRUPT_CORE0_HP_SYSREG_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1c4)
/** INTERRUPT_CORE0_HP_SYSREG_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_HP_SYSREG_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_HP_SYSREG_INTR_MAP_M  (INTERRUPT_CORE0_HP_SYSREG_INTR_MAP_V << INTERRUPT_CORE0_HP_SYSREG_INTR_MAP_S)
#define INTERRUPT_CORE0_HP_SYSREG_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_HP_SYSREG_INTR_MAP_S  0
/** INTERRUPT_CORE0_HP_SYSREG_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_HP_SYSREG_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_HP_SYSREG_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_HP_SYSREG_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_HP_SYSREG_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_HP_SYSREG_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_HP_SYSREG_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_PCNT0_INTR_MAP_REG register
 *  PCNT0_INTR mapping register
 */
#define INTERRUPT_CORE0_PCNT0_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1c8)
/** INTERRUPT_CORE0_PCNT0_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_PCNT0_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_PCNT0_INTR_MAP_M  (INTERRUPT_CORE0_PCNT0_INTR_MAP_V << INTERRUPT_CORE0_PCNT0_INTR_MAP_S)
#define INTERRUPT_CORE0_PCNT0_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_PCNT0_INTR_MAP_S  0
/** INTERRUPT_CORE0_PCNT0_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_PCNT0_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_PCNT0_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_PCNT0_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_PCNT0_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_PCNT0_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_PCNT0_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_PCNT1_INTR_MAP_REG register
 *  PCNT1_INTR mapping register
 */
#define INTERRUPT_CORE0_PCNT1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1cc)
/** INTERRUPT_CORE0_PCNT1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_PCNT1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_PCNT1_INTR_MAP_M  (INTERRUPT_CORE0_PCNT1_INTR_MAP_V << INTERRUPT_CORE0_PCNT1_INTR_MAP_S)
#define INTERRUPT_CORE0_PCNT1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_PCNT1_INTR_MAP_S  0
/** INTERRUPT_CORE0_PCNT1_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_PCNT1_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_PCNT1_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_PCNT1_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_PCNT1_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_PCNT1_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_PCNT1_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_HP_PAU_INTR_MAP_REG register
 *  HP_PAU_INTR mapping register
 */
#define INTERRUPT_CORE0_HP_PAU_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1d0)
/** INTERRUPT_CORE0_HP_PAU_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_HP_PAU_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_HP_PAU_INTR_MAP_M  (INTERRUPT_CORE0_HP_PAU_INTR_MAP_V << INTERRUPT_CORE0_HP_PAU_INTR_MAP_S)
#define INTERRUPT_CORE0_HP_PAU_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_HP_PAU_INTR_MAP_S  0
/** INTERRUPT_CORE0_HP_PAU_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_HP_PAU_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_HP_PAU_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_HP_PAU_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_HP_PAU_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_HP_PAU_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_HP_PAU_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_HP_PARLIO_RX_INTR_MAP_REG register
 *  HP_PARLIO_RX_INTR mapping register
 */
#define INTERRUPT_CORE0_HP_PARLIO_RX_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1d4)
/** INTERRUPT_CORE0_HP_PARLIO_RX_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_HP_PARLIO_RX_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_HP_PARLIO_RX_INTR_MAP_M  (INTERRUPT_CORE0_HP_PARLIO_RX_INTR_MAP_V << INTERRUPT_CORE0_HP_PARLIO_RX_INTR_MAP_S)
#define INTERRUPT_CORE0_HP_PARLIO_RX_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_HP_PARLIO_RX_INTR_MAP_S  0
/** INTERRUPT_CORE0_HP_PARLIO_RX_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_HP_PARLIO_RX_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_HP_PARLIO_RX_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_HP_PARLIO_RX_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_HP_PARLIO_RX_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_HP_PARLIO_RX_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_HP_PARLIO_RX_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_HP_PARLIO_TX_INTR_MAP_REG register
 *  HP_PARLIO_TX_INTR mapping register
 */
#define INTERRUPT_CORE0_HP_PARLIO_TX_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1d8)
/** INTERRUPT_CORE0_HP_PARLIO_TX_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_HP_PARLIO_TX_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_HP_PARLIO_TX_INTR_MAP_M  (INTERRUPT_CORE0_HP_PARLIO_TX_INTR_MAP_V << INTERRUPT_CORE0_HP_PARLIO_TX_INTR_MAP_S)
#define INTERRUPT_CORE0_HP_PARLIO_TX_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_HP_PARLIO_TX_INTR_MAP_S  0
/** INTERRUPT_CORE0_HP_PARLIO_TX_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_HP_PARLIO_TX_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_HP_PARLIO_TX_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_HP_PARLIO_TX_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_HP_PARLIO_TX_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_HP_PARLIO_TX_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_HP_PARLIO_TX_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_BUS_MONITOR_INTR_MAP_REG register
 *  BUS_MONITOR_INTR mapping register
 */
#define INTERRUPT_CORE0_BUS_MONITOR_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1dc)
/** INTERRUPT_CORE0_BUS_MONITOR_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_BUS_MONITOR_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_BUS_MONITOR_INTR_MAP_M  (INTERRUPT_CORE0_BUS_MONITOR_INTR_MAP_V << INTERRUPT_CORE0_BUS_MONITOR_INTR_MAP_S)
#define INTERRUPT_CORE0_BUS_MONITOR_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_BUS_MONITOR_INTR_MAP_S  0
/** INTERRUPT_CORE0_BUS_MONITOR_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_BUS_MONITOR_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_BUS_MONITOR_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_BUS_MONITOR_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_BUS_MONITOR_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_BUS_MONITOR_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_BUS_MONITOR_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_MODEM_WIFI_MAC_INTR_MAP_REG register
 *  MODEM_WIFI_MAC_INTR mapping register
 */
#define INTERRUPT_CORE0_MODEM_WIFI_MAC_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1e0)
/** INTERRUPT_CORE0_MODEM_WIFI_MAC_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_MODEM_WIFI_MAC_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_MODEM_WIFI_MAC_INTR_MAP_M  (INTERRUPT_CORE0_MODEM_WIFI_MAC_INTR_MAP_V << INTERRUPT_CORE0_MODEM_WIFI_MAC_INTR_MAP_S)
#define INTERRUPT_CORE0_MODEM_WIFI_MAC_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_MODEM_WIFI_MAC_INTR_MAP_S  0
/** INTERRUPT_CORE0_MODEM_WIFI_MAC_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_MODEM_WIFI_MAC_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_MODEM_WIFI_MAC_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_MODEM_WIFI_MAC_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_MODEM_WIFI_MAC_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_MODEM_WIFI_MAC_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_MODEM_WIFI_MAC_INTR_PASS_LEVEL_S  8

