espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core0_reg.h
/** INTERRUPT_CORE0_MODEM_WIFI_MAC_NMI_INTR_MAP_REG register
 *  MODEM_WIFI_MAC_NMI_INTR mapping register
 */
#define INTERRUPT_CORE0_MODEM_WIFI_MAC_NMI_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1e4)
/** INTERRUPT_CORE0_MODEM_WIFI_MAC_NMI_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_MODEM_WIFI_MAC_NMI_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_MODEM_WIFI_MAC_NMI_INTR_MAP_M  (INTERRUPT_CORE0_MODEM_WIFI_MAC_NMI_INTR_MAP_V << INTERRUPT_CORE0_MODEM_WIFI_MAC_NMI_INTR_MAP_S)
#define INTERRUPT_CORE0_MODEM_WIFI_MAC_NMI_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_MODEM_WIFI_MAC_NMI_INTR_MAP_S  0
/** INTERRUPT_CORE0_MODEM_WIFI_MAC_NMI_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_MODEM_WIFI_MAC_NMI_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_MODEM_WIFI_MAC_NMI_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_MODEM_WIFI_MAC_NMI_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_MODEM_WIFI_MAC_NMI_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_MODEM_WIFI_MAC_NMI_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_MODEM_WIFI_MAC_NMI_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_MODEM_WIFI_PWR_INTR_MAP_REG register
 *  MODEM_WIFI_PWR_INTR mapping register
 */
#define INTERRUPT_CORE0_MODEM_WIFI_PWR_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1e8)
/** INTERRUPT_CORE0_MODEM_WIFI_PWR_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_MODEM_WIFI_PWR_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_MODEM_WIFI_PWR_INTR_MAP_M  (INTERRUPT_CORE0_MODEM_WIFI_PWR_INTR_MAP_V << INTERRUPT_CORE0_MODEM_WIFI_PWR_INTR_MAP_S)
#define INTERRUPT_CORE0_MODEM_WIFI_PWR_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_MODEM_WIFI_PWR_INTR_MAP_S  0
/** INTERRUPT_CORE0_MODEM_WIFI_PWR_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_MODEM_WIFI_PWR_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_MODEM_WIFI_PWR_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_MODEM_WIFI_PWR_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_MODEM_WIFI_PWR_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_MODEM_WIFI_PWR_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_MODEM_WIFI_PWR_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_MODEM_WIFI_BB_INTR_MAP_REG register
 *  MODEM_WIFI_BB_INTR mapping register
 */
#define INTERRUPT_CORE0_MODEM_WIFI_BB_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1ec)
/** INTERRUPT_CORE0_MODEM_WIFI_BB_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_MODEM_WIFI_BB_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_MODEM_WIFI_BB_INTR_MAP_M  (INTERRUPT_CORE0_MODEM_WIFI_BB_INTR_MAP_V << INTERRUPT_CORE0_MODEM_WIFI_BB_INTR_MAP_S)
#define INTERRUPT_CORE0_MODEM_WIFI_BB_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_MODEM_WIFI_BB_INTR_MAP_S  0
/** INTERRUPT_CORE0_MODEM_WIFI_BB_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_MODEM_WIFI_BB_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_MODEM_WIFI_BB_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_MODEM_WIFI_BB_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_MODEM_WIFI_BB_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_MODEM_WIFI_BB_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_MODEM_WIFI_BB_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_MODEM_BT_MAC_INTR_MAP_REG register
 *  MODEM_BT_MAC_INTR mapping register
 */
#define INTERRUPT_CORE0_MODEM_BT_MAC_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1f0)
/** INTERRUPT_CORE0_MODEM_BT_MAC_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_MODEM_BT_MAC_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_MODEM_BT_MAC_INTR_MAP_M  (INTERRUPT_CORE0_MODEM_BT_MAC_INTR_MAP_V << INTERRUPT_CORE0_MODEM_BT_MAC_INTR_MAP_S)
#define INTERRUPT_CORE0_MODEM_BT_MAC_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_MODEM_BT_MAC_INTR_MAP_S  0
/** INTERRUPT_CORE0_MODEM_BT_MAC_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_MODEM_BT_MAC_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_MODEM_BT_MAC_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_MODEM_BT_MAC_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_MODEM_BT_MAC_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_MODEM_BT_MAC_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_MODEM_BT_MAC_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_MODEM_BT_BB_INTR_MAP_REG register
 *  MODEM_BT_BB_INTR mapping register
 */
#define INTERRUPT_CORE0_MODEM_BT_BB_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1f4)
/** INTERRUPT_CORE0_MODEM_BT_BB_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_MODEM_BT_BB_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_MODEM_BT_BB_INTR_MAP_M  (INTERRUPT_CORE0_MODEM_BT_BB_INTR_MAP_V << INTERRUPT_CORE0_MODEM_BT_BB_INTR_MAP_S)
#define INTERRUPT_CORE0_MODEM_BT_BB_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_MODEM_BT_BB_INTR_MAP_S  0
/** INTERRUPT_CORE0_MODEM_BT_BB_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_MODEM_BT_BB_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_MODEM_BT_BB_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_MODEM_BT_BB_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_MODEM_BT_BB_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_MODEM_BT_BB_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_MODEM_BT_BB_INTR_PASS_LEVEL_S  8

