espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core0_reg.h
/** INTERRUPT_CORE0_MODEM_BT_BB_NMI_INTR_MAP_REG register
 *  MODEM_BT_BB_NMI_INTR mapping register
 */
#define INTERRUPT_CORE0_MODEM_BT_BB_NMI_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1f8)
/** INTERRUPT_CORE0_MODEM_BT_BB_NMI_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_MODEM_BT_BB_NMI_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_MODEM_BT_BB_NMI_INTR_MAP_M  (INTERRUPT_CORE0_MODEM_BT_BB_NMI_INTR_MAP_V << INTERRUPT_CORE0_MODEM_BT_BB_NMI_INTR_MAP_S)
#define INTERRUPT_CORE0_MODEM_BT_BB_NMI_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_MODEM_BT_BB_NMI_INTR_MAP_S  0
/** INTERRUPT_CORE0_MODEM_BT_BB_NMI_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_MODEM_BT_BB_NMI_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_MODEM_BT_BB_NMI_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_MODEM_BT_BB_NMI_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_MODEM_BT_BB_NMI_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_MODEM_BT_BB_NMI_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_MODEM_BT_BB_NMI_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_MODEM_LP_TIMER_INTR_MAP_REG register
 *  MODEM_LP_TIMER_INTR mapping register
 */
#define INTERRUPT_CORE0_MODEM_LP_TIMER_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x1fc)
/** INTERRUPT_CORE0_MODEM_LP_TIMER_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_MODEM_LP_TIMER_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_MODEM_LP_TIMER_INTR_MAP_M  (INTERRUPT_CORE0_MODEM_LP_TIMER_INTR_MAP_V << INTERRUPT_CORE0_MODEM_LP_TIMER_INTR_MAP_S)
#define INTERRUPT_CORE0_MODEM_LP_TIMER_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_MODEM_LP_TIMER_INTR_MAP_S  0
/** INTERRUPT_CORE0_MODEM_LP_TIMER_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_MODEM_LP_TIMER_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_MODEM_LP_TIMER_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_MODEM_LP_TIMER_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_MODEM_LP_TIMER_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_MODEM_LP_TIMER_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_MODEM_LP_TIMER_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_MODEM_COEX_INTR_MAP_REG register
 *  MODEM_COEX_INTR mapping register
 */
#define INTERRUPT_CORE0_MODEM_COEX_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x200)
/** INTERRUPT_CORE0_MODEM_COEX_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_MODEM_COEX_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_MODEM_COEX_INTR_MAP_M  (INTERRUPT_CORE0_MODEM_COEX_INTR_MAP_V << INTERRUPT_CORE0_MODEM_COEX_INTR_MAP_S)
#define INTERRUPT_CORE0_MODEM_COEX_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_MODEM_COEX_INTR_MAP_S  0
/** INTERRUPT_CORE0_MODEM_COEX_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_MODEM_COEX_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_MODEM_COEX_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_MODEM_COEX_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_MODEM_COEX_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_MODEM_COEX_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_MODEM_COEX_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_MODEM_BLE_TIMER_INTR_MAP_REG register
 *  MODEM_BLE_TIMER_INTR mapping register
 */
#define INTERRUPT_CORE0_MODEM_BLE_TIMER_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x204)
/** INTERRUPT_CORE0_MODEM_BLE_TIMER_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_MODEM_BLE_TIMER_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_MODEM_BLE_TIMER_INTR_MAP_M  (INTERRUPT_CORE0_MODEM_BLE_TIMER_INTR_MAP_V << INTERRUPT_CORE0_MODEM_BLE_TIMER_INTR_MAP_S)
#define INTERRUPT_CORE0_MODEM_BLE_TIMER_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_MODEM_BLE_TIMER_INTR_MAP_S  0
/** INTERRUPT_CORE0_MODEM_BLE_TIMER_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_MODEM_BLE_TIMER_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_MODEM_BLE_TIMER_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_MODEM_BLE_TIMER_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_MODEM_BLE_TIMER_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_MODEM_BLE_TIMER_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_MODEM_BLE_TIMER_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_MODEM_BLE_SEC_INTR_MAP_REG register
 *  MODEM_BLE_SEC_INTR mapping register
 */
#define INTERRUPT_CORE0_MODEM_BLE_SEC_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x208)
/** INTERRUPT_CORE0_MODEM_BLE_SEC_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_MODEM_BLE_SEC_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_MODEM_BLE_SEC_INTR_MAP_M  (INTERRUPT_CORE0_MODEM_BLE_SEC_INTR_MAP_V << INTERRUPT_CORE0_MODEM_BLE_SEC_INTR_MAP_S)
#define INTERRUPT_CORE0_MODEM_BLE_SEC_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_MODEM_BLE_SEC_INTR_MAP_S  0
/** INTERRUPT_CORE0_MODEM_BLE_SEC_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_MODEM_BLE_SEC_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_MODEM_BLE_SEC_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_MODEM_BLE_SEC_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_MODEM_BLE_SEC_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_MODEM_BLE_SEC_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_MODEM_BLE_SEC_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_MODEM_I2C_MST_INTR_MAP_REG register
 *  MODEM_I2C_MST_INTR mapping register
 */
#define INTERRUPT_CORE0_MODEM_I2C_MST_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x20c)
/** INTERRUPT_CORE0_MODEM_I2C_MST_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_MODEM_I2C_MST_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_MODEM_I2C_MST_INTR_MAP_M  (INTERRUPT_CORE0_MODEM_I2C_MST_INTR_MAP_V << INTERRUPT_CORE0_MODEM_I2C_MST_INTR_MAP_S)
#define INTERRUPT_CORE0_MODEM_I2C_MST_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_MODEM_I2C_MST_INTR_MAP_S  0
/** INTERRUPT_CORE0_MODEM_I2C_MST_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_MODEM_I2C_MST_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_MODEM_I2C_MST_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_MODEM_I2C_MST_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_MODEM_I2C_MST_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_MODEM_I2C_MST_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_MODEM_I2C_MST_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_MODEM_ZB_MAC_INTR_MAP_REG register
 *  MODEM_ZB_MAC_INTR mapping register
 */
#define INTERRUPT_CORE0_MODEM_ZB_MAC_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x210)
/** INTERRUPT_CORE0_MODEM_ZB_MAC_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_MODEM_ZB_MAC_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_MODEM_ZB_MAC_INTR_MAP_M  (INTERRUPT_CORE0_MODEM_ZB_MAC_INTR_MAP_V << INTERRUPT_CORE0_MODEM_ZB_MAC_INTR_MAP_S)
#define INTERRUPT_CORE0_MODEM_ZB_MAC_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_MODEM_ZB_MAC_INTR_MAP_S  0
/** INTERRUPT_CORE0_MODEM_ZB_MAC_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_MODEM_ZB_MAC_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_MODEM_ZB_MAC_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_MODEM_ZB_MAC_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_MODEM_ZB_MAC_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_MODEM_ZB_MAC_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_MODEM_ZB_MAC_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_MODEM_BT_MAC_INT1_INTR_MAP_REG register
 *  MODEM_BT_MAC_INT1_INTR mapping register
 */
#define INTERRUPT_CORE0_MODEM_BT_MAC_INT1_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x214)
/** INTERRUPT_CORE0_MODEM_BT_MAC_INT1_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_MODEM_BT_MAC_INT1_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_MODEM_BT_MAC_INT1_INTR_MAP_M  (INTERRUPT_CORE0_MODEM_BT_MAC_INT1_INTR_MAP_V << INTERRUPT_CORE0_MODEM_BT_MAC_INT1_INTR_MAP_S)
#define INTERRUPT_CORE0_MODEM_BT_MAC_INT1_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_MODEM_BT_MAC_INT1_INTR_MAP_S  0
/** INTERRUPT_CORE0_MODEM_BT_MAC_INT1_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_MODEM_BT_MAC_INT1_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_MODEM_BT_MAC_INT1_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_MODEM_BT_MAC_INT1_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_MODEM_BT_MAC_INT1_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_MODEM_BT_MAC_INT1_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_MODEM_BT_MAC_INT1_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_CORDIC_INTR_MAP_REG register
 *  CORDIC_INTR mapping register
 */
#define INTERRUPT_CORE0_CORDIC_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x218)
/** INTERRUPT_CORE0_CORDIC_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_CORDIC_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_CORDIC_INTR_MAP_M  (INTERRUPT_CORE0_CORDIC_INTR_MAP_V << INTERRUPT_CORE0_CORDIC_INTR_MAP_S)
#define INTERRUPT_CORE0_CORDIC_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_CORDIC_INTR_MAP_S  0
/** INTERRUPT_CORE0_CORDIC_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default: 0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_CORDIC_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_CORDIC_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_CORDIC_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_CORDIC_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_CORDIC_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_CORDIC_INTR_PASS_LEVEL_S  8

