espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core0_reg.h
/** INTERRUPT_CORE0_LP_SW_INVALID_SLEEP_INTR_MAP_REG register
 *  LP_SW_INVALID_SLEEP_INTR mapping register
 */
#define INTERRUPT_CORE0_LP_SW_INVALID_SLEEP_INTR_MAP_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x2a0)
/** INTERRUPT_CORE0_LP_SW_INVALID_SLEEP_INTR_MAP : R/W; bitpos: [5:0]; default: 0;
 *  Configures the interrupt source into one CPU interrupt.
 */
#define INTERRUPT_CORE0_LP_SW_INVALID_SLEEP_INTR_MAP    0x0000003FU
#define INTERRUPT_CORE0_LP_SW_INVALID_SLEEP_INTR_MAP_M  (INTERRUPT_CORE0_LP_SW_INVALID_SLEEP_INTR_MAP_V << INTERRUPT_CORE0_LP_SW_INVALID_SLEEP_INTR_MAP_S)
#define INTERRUPT_CORE0_LP_SW_INVALID_SLEEP_INTR_MAP_V  0x0000003FU
#define INTERRUPT_CORE0_LP_SW_INVALID_SLEEP_INTR_MAP_S  0
/** INTERRUPT_CORE0_LP_SW_INVALID_SLEEP_INTR_PASS_LEVEL : R/W; bitpos: [9:8]; default:
 *  0;
 *  Set as Non-zero value to enable interrupt-remap feature of the interrupt source.
 *  0=disable remap feature. 1=enable remap feature with S-Level. 2/3=enable remap
 *  feature with M-Level.
 */
#define INTERRUPT_CORE0_LP_SW_INVALID_SLEEP_INTR_PASS_LEVEL    0x00000003U
#define INTERRUPT_CORE0_LP_SW_INVALID_SLEEP_INTR_PASS_LEVEL_M  (INTERRUPT_CORE0_LP_SW_INVALID_SLEEP_INTR_PASS_LEVEL_V << INTERRUPT_CORE0_LP_SW_INVALID_SLEEP_INTR_PASS_LEVEL_S)
#define INTERRUPT_CORE0_LP_SW_INVALID_SLEEP_INTR_PASS_LEVEL_V  0x00000003U
#define INTERRUPT_CORE0_LP_SW_INVALID_SLEEP_INTR_PASS_LEVEL_S  8

/** INTERRUPT_CORE0_SIG_IDX_ASSERT_IN_SEC_REG register
 *  reserved
 */
#define INTERRUPT_CORE0_SIG_IDX_ASSERT_IN_SEC_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x2a4)
/** INTERRUPT_CORE0_INT_SIG_IDX_ASSERT_IN_S : R/W; bitpos: [5:0]; default: 0;
 *  reserved
 */
#define INTERRUPT_CORE0_INT_SIG_IDX_ASSERT_IN_S    0x0000003FU
#define INTERRUPT_CORE0_INT_SIG_IDX_ASSERT_IN_S_M  (INTERRUPT_CORE0_INT_SIG_IDX_ASSERT_IN_S_V << INTERRUPT_CORE0_INT_SIG_IDX_ASSERT_IN_S_S)
#define INTERRUPT_CORE0_INT_SIG_IDX_ASSERT_IN_S_V  0x0000003FU
#define INTERRUPT_CORE0_INT_SIG_IDX_ASSERT_IN_S_S  0
/** INTERRUPT_CORE0_INT_SIG_IDX_ASSERT_IN_M : R/W; bitpos: [11:6]; default: 0;
 *  reserved
 */
#define INTERRUPT_CORE0_INT_SIG_IDX_ASSERT_IN_M    0x0000003FU
#define INTERRUPT_CORE0_INT_SIG_IDX_ASSERT_IN_M_M  (INTERRUPT_CORE0_INT_SIG_IDX_ASSERT_IN_M_V << INTERRUPT_CORE0_INT_SIG_IDX_ASSERT_IN_M_S)
#define INTERRUPT_CORE0_INT_SIG_IDX_ASSERT_IN_M_V  0x0000003FU
#define INTERRUPT_CORE0_INT_SIG_IDX_ASSERT_IN_M_S  6

/** INTERRUPT_CORE0_INT_STATUS_REG_0_REG register
 *  Status register for interrupt sources 0 ~ 31
 */
#define INTERRUPT_CORE0_INT_STATUS_REG_0_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x2a8)
/** INTERRUPT_CORE0_INT_STATUS_0 : RO; bitpos: [31:0]; default: 0;
 *  Represents the status of the interrupt sources within interrupt-index-range 0 ~ 31.
 *  Each bit corresponds to one interrupt source
 *  0:The corresponding interrupt source triggered an interrupt
 *  1:No interrupt triggered
 */
#define INTERRUPT_CORE0_INT_STATUS_0    0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_STATUS_0_M  (INTERRUPT_CORE0_INT_STATUS_0_V << INTERRUPT_CORE0_INT_STATUS_0_S)
#define INTERRUPT_CORE0_INT_STATUS_0_V  0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_STATUS_0_S  0

/** INTERRUPT_CORE0_INT_STATUS_REG_1_REG register
 *  Status register for interrupt sources 32 ~ 63
 */
#define INTERRUPT_CORE0_INT_STATUS_REG_1_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x2ac)
/** INTERRUPT_CORE0_INT_STATUS_1 : RO; bitpos: [31:0]; default: 0;
 *  Represents the status of the interrupt sources within interrupt-index-range 32 ~
 *  63. Each bit corresponds to one interrupt source
 *  0:The corresponding interrupt source triggered an interrupt
 *  1:No interrupt triggered
 */
#define INTERRUPT_CORE0_INT_STATUS_1    0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_STATUS_1_M  (INTERRUPT_CORE0_INT_STATUS_1_V << INTERRUPT_CORE0_INT_STATUS_1_S)
#define INTERRUPT_CORE0_INT_STATUS_1_V  0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_STATUS_1_S  0

/** INTERRUPT_CORE0_INT_STATUS_REG_2_REG register
 *  Status register for interrupt sources 64 ~ 95
 */
#define INTERRUPT_CORE0_INT_STATUS_REG_2_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x2b0)
/** INTERRUPT_CORE0_INT_STATUS_2 : RO; bitpos: [31:0]; default: 0;
 *  Represents the status of the interrupt sources within interrupt-index-range 64 ~
 *  95. Each bit corresponds to one interrupt source
 *  0:The corresponding interrupt source triggered an interrupt
 *  1:No interrupt triggered
 */
#define INTERRUPT_CORE0_INT_STATUS_2    0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_STATUS_2_M  (INTERRUPT_CORE0_INT_STATUS_2_V << INTERRUPT_CORE0_INT_STATUS_2_S)
#define INTERRUPT_CORE0_INT_STATUS_2_V  0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_STATUS_2_S  0

/** INTERRUPT_CORE0_INT_STATUS_REG_3_REG register
 *  Status register for interrupt sources 96 ~ 127
 */
#define INTERRUPT_CORE0_INT_STATUS_REG_3_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x2b4)
/** INTERRUPT_CORE0_INT_STATUS_3 : RO; bitpos: [31:0]; default: 0;
 *  Represents the status of the interrupt sources within interrupt-index-range 96 ~
 *  127. Each bit corresponds to one interrupt source
 *  0:The corresponding interrupt source triggered an interrupt
 *  1:No interrupt triggered
 */
#define INTERRUPT_CORE0_INT_STATUS_3    0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_STATUS_3_M  (INTERRUPT_CORE0_INT_STATUS_3_V << INTERRUPT_CORE0_INT_STATUS_3_S)
#define INTERRUPT_CORE0_INT_STATUS_3_V  0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_STATUS_3_S  0

/** INTERRUPT_CORE0_INT_STATUS_REG_4_REG register
 *  Status register for interrupt sources 128 ~ 159
 */
#define INTERRUPT_CORE0_INT_STATUS_REG_4_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x2b8)
/** INTERRUPT_CORE0_INT_STATUS_4 : RO; bitpos: [31:0]; default: 0;
 *  Represents the status of the interrupt sources within interrupt-index-range 128 ~
 *  159. Each bit corresponds to one interrupt source
 *  0:The corresponding interrupt source triggered an interrupt
 *  1:No interrupt triggered
 */
#define INTERRUPT_CORE0_INT_STATUS_4    0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_STATUS_4_M  (INTERRUPT_CORE0_INT_STATUS_4_V << INTERRUPT_CORE0_INT_STATUS_4_S)
#define INTERRUPT_CORE0_INT_STATUS_4_V  0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_STATUS_4_S  0

/** INTERRUPT_CORE0_INT_STATUS_REG_5_REG register
 *  Status register for interrupt sources 160 ~ 168
 */
#define INTERRUPT_CORE0_INT_STATUS_REG_5_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x2bc)
/** INTERRUPT_CORE0_INT_STATUS_5 : RO; bitpos: [8:0]; default: 0;
 *  Represents the status of the interrupt sources within interrupt-index-range 160 ~
 *  168. Each bit corresponds to one interrupt source
 *  0:The corresponding interrupt source triggered an interrupt
 *  1:No interrupt triggered
 */
#define INTERRUPT_CORE0_INT_STATUS_5    0x000001FFU
#define INTERRUPT_CORE0_INT_STATUS_5_M  (INTERRUPT_CORE0_INT_STATUS_5_V << INTERRUPT_CORE0_INT_STATUS_5_S)
#define INTERRUPT_CORE0_INT_STATUS_5_V  0x000001FFU
#define INTERRUPT_CORE0_INT_STATUS_5_S  0

/** INTERRUPT_CORE0_SRC_PASS_IN_S_STATUS_0_REG register
 *  supervisor-mode PASS_IN status register for interrupt sources 0 ~ 31
 */
#define INTERRUPT_CORE0_SRC_PASS_IN_S_STATUS_0_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x2c0)
/** INTERRUPT_CORE0_INT_SRC_PASS_IN_S_STATUS_0 : RO; bitpos: [31:0]; default: 0;
 *  Represents the supervisor-mode PASS_IN status of the interrupt sources within
 *  interrupt-index-range 0 ~ 31. Each bit corresponds to one interrupt source
 *  0:The corresponding interrupt source is not PASS in supervisor-mode.
 *  1:The corresponding interrupt source is PASS in supervisor-mode.
 */
#define INTERRUPT_CORE0_INT_SRC_PASS_IN_S_STATUS_0    0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_SRC_PASS_IN_S_STATUS_0_M  (INTERRUPT_CORE0_INT_SRC_PASS_IN_S_STATUS_0_V << INTERRUPT_CORE0_INT_SRC_PASS_IN_S_STATUS_0_S)
#define INTERRUPT_CORE0_INT_SRC_PASS_IN_S_STATUS_0_V  0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_SRC_PASS_IN_S_STATUS_0_S  0

/** INTERRUPT_CORE0_SRC_PASS_IN_S_STATUS_1_REG register
 *  supervisor-mode PASS_IN status register for interrupt sources 32 ~ 63
 */
#define INTERRUPT_CORE0_SRC_PASS_IN_S_STATUS_1_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x2c4)
/** INTERRUPT_CORE0_INT_SRC_PASS_IN_S_STATUS_1 : RO; bitpos: [31:0]; default: 0;
 *  Represents the supervisor-mode PASS_IN status of the interrupt sources within
 *  interrupt-index-range 32 ~ 63. Each bit corresponds to one interrupt source
 *  0:The corresponding interrupt source is not PASS in supervisor-mode.
 *  1:The corresponding interrupt source is PASS in supervisor-mode.
 */
#define INTERRUPT_CORE0_INT_SRC_PASS_IN_S_STATUS_1    0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_SRC_PASS_IN_S_STATUS_1_M  (INTERRUPT_CORE0_INT_SRC_PASS_IN_S_STATUS_1_V << INTERRUPT_CORE0_INT_SRC_PASS_IN_S_STATUS_1_S)
#define INTERRUPT_CORE0_INT_SRC_PASS_IN_S_STATUS_1_V  0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_SRC_PASS_IN_S_STATUS_1_S  0

/** INTERRUPT_CORE0_SRC_PASS_IN_S_STATUS_2_REG register
 *  supervisor-mode PASS_IN status register for interrupt sources 64 ~ 95
 */
#define INTERRUPT_CORE0_SRC_PASS_IN_S_STATUS_2_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x2c8)
/** INTERRUPT_CORE0_INT_SRC_PASS_IN_S_STATUS_2 : RO; bitpos: [31:0]; default: 0;
 *  Represents the supervisor-mode PASS_IN status of the interrupt sources within
 *  interrupt-index-range 64 ~ 95. Each bit corresponds to one interrupt source
 *  0:The corresponding interrupt source is not PASS in supervisor-mode.
 *  1:The corresponding interrupt source is PASS in supervisor-mode.
 */
#define INTERRUPT_CORE0_INT_SRC_PASS_IN_S_STATUS_2    0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_SRC_PASS_IN_S_STATUS_2_M  (INTERRUPT_CORE0_INT_SRC_PASS_IN_S_STATUS_2_V << INTERRUPT_CORE0_INT_SRC_PASS_IN_S_STATUS_2_S)
#define INTERRUPT_CORE0_INT_SRC_PASS_IN_S_STATUS_2_V  0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_SRC_PASS_IN_S_STATUS_2_S  0

