espressif/esp-idf/components/soc/esp32s31/register/soc/interrupt_core0_reg.h
/** INTERRUPT_CORE0_SRC_PASS_IN_M_STATUS_4_REG register
 *  machine-mode PASS_IN_M status register for interrupt sources 128 ~ 159
 */
#define INTERRUPT_CORE0_SRC_PASS_IN_M_STATUS_4_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x2e8)
/** INTERRUPT_CORE0_INT_SRC_PASS_IN_M_STATUS_4 : RO; bitpos: [31:0]; default: 0;
 *  Represents the machine-mode PASS_IN status of the interrupt sources within
 *  interrupt-index-range 128 ~ 159. Each bit corresponds to one interrupt source
 *  0:The corresponding interrupt source is not PASS in machine-mode.
 *  1:The corresponding interrupt source is PASS in machine-mode.
 */
#define INTERRUPT_CORE0_INT_SRC_PASS_IN_M_STATUS_4    0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_SRC_PASS_IN_M_STATUS_4_M  (INTERRUPT_CORE0_INT_SRC_PASS_IN_M_STATUS_4_V << INTERRUPT_CORE0_INT_SRC_PASS_IN_M_STATUS_4_S)
#define INTERRUPT_CORE0_INT_SRC_PASS_IN_M_STATUS_4_V  0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_SRC_PASS_IN_M_STATUS_4_S  0

/** INTERRUPT_CORE0_SRC_PASS_IN_M_STATUS_5_REG register
 *  machine-mode PASS_IN_M status register for interrupt sources 160 ~ 168
 */
#define INTERRUPT_CORE0_SRC_PASS_IN_M_STATUS_5_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x2ec)
/** INTERRUPT_CORE0_INT_SRC_PASS_IN_M_STATUS_5 : RO; bitpos: [8:0]; default: 0;
 *  Represents the machine-mode PASS_IN status of the interrupt sources with
 *  interrupt-index-range 160 ~ 168. Each bit corresponds to one interrupt source
 *  0:The corresponding interrupt source is not PASS in machine-mode.
 *  1:The corresponding interrupt source is PASS in machine-mode.
 */
#define INTERRUPT_CORE0_INT_SRC_PASS_IN_M_STATUS_5    0x000001FFU
#define INTERRUPT_CORE0_INT_SRC_PASS_IN_M_STATUS_5_M  (INTERRUPT_CORE0_INT_SRC_PASS_IN_M_STATUS_5_V << INTERRUPT_CORE0_INT_SRC_PASS_IN_M_STATUS_5_S)
#define INTERRUPT_CORE0_INT_SRC_PASS_IN_M_STATUS_5_V  0x000001FFU
#define INTERRUPT_CORE0_INT_SRC_PASS_IN_M_STATUS_5_S  0

/** INTERRUPT_CORE0_CONFIG_STATE_REG register
 *  reserved
 */
#define INTERRUPT_CORE0_CONFIG_STATE_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x2f0)
/** INTERRUPT_CORE0_SIG_IDX_ASSERT_S_ERR : RO; bitpos: [0]; default: 0;
 *  reserved
 */
#define INTERRUPT_CORE0_SIG_IDX_ASSERT_S_ERR    (BIT(0))
#define INTERRUPT_CORE0_SIG_IDX_ASSERT_S_ERR_M  (INTERRUPT_CORE0_SIG_IDX_ASSERT_S_ERR_V << INTERRUPT_CORE0_SIG_IDX_ASSERT_S_ERR_S)
#define INTERRUPT_CORE0_SIG_IDX_ASSERT_S_ERR_V  0x00000001U
#define INTERRUPT_CORE0_SIG_IDX_ASSERT_S_ERR_S  0
/** INTERRUPT_CORE0_SIG_IDX_ASSERT_M_ERR : RO; bitpos: [1]; default: 0;
 *  reserved
 */
#define INTERRUPT_CORE0_SIG_IDX_ASSERT_M_ERR    (BIT(1))
#define INTERRUPT_CORE0_SIG_IDX_ASSERT_M_ERR_M  (INTERRUPT_CORE0_SIG_IDX_ASSERT_M_ERR_V << INTERRUPT_CORE0_SIG_IDX_ASSERT_M_ERR_S)
#define INTERRUPT_CORE0_SIG_IDX_ASSERT_M_ERR_V  0x00000001U
#define INTERRUPT_CORE0_SIG_IDX_ASSERT_M_ERR_S  1

/** INTERRUPT_CORE0_S_STATUS_REG register
 *  reserved
 */
#define INTERRUPT_CORE0_S_STATUS_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x2f4)
/** INTERRUPT_CORE0_INT_S_STATUS : RO; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define INTERRUPT_CORE0_INT_S_STATUS    0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_S_STATUS_M  (INTERRUPT_CORE0_INT_S_STATUS_V << INTERRUPT_CORE0_INT_S_STATUS_S)
#define INTERRUPT_CORE0_INT_S_STATUS_V  0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_S_STATUS_S  0

/** INTERRUPT_CORE0_M_STATUS_REG register
 *  reserved
 */
#define INTERRUPT_CORE0_M_STATUS_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x2f8)
/** INTERRUPT_CORE0_INT_M_STATUS : RO; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define INTERRUPT_CORE0_INT_M_STATUS    0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_M_STATUS_M  (INTERRUPT_CORE0_INT_M_STATUS_V << INTERRUPT_CORE0_INT_M_STATUS_S)
#define INTERRUPT_CORE0_INT_M_STATUS_V  0xFFFFFFFFU
#define INTERRUPT_CORE0_INT_M_STATUS_S  0

/** INTERRUPT_CORE0_CLOCK_GATE_REG register
 *  Interrupt clock gating configure register
 */
#define INTERRUPT_CORE0_CLOCK_GATE_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x2fc)
/** INTERRUPT_CORE0_REG_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Interrupt clock gating configure register
 */
#define INTERRUPT_CORE0_REG_CLK_EN    (BIT(0))
#define INTERRUPT_CORE0_REG_CLK_EN_M  (INTERRUPT_CORE0_REG_CLK_EN_V << INTERRUPT_CORE0_REG_CLK_EN_S)
#define INTERRUPT_CORE0_REG_CLK_EN_V  0x00000001U
#define INTERRUPT_CORE0_REG_CLK_EN_S  0

/** INTERRUPT_CORE0_INTERRUPT_DATE_REG register
 *  Version control register
 */
#define INTERRUPT_CORE0_INTERRUPT_DATE_REG (DR_REG_INTERRUPT_CORE0_BASE + 0x7fc)
/** INTERRUPT_CORE0_INTERRUPT_DATE : R/W; bitpos: [27:0]; default: 38834448;
 *  Version control register
 */
#define INTERRUPT_CORE0_INTERRUPT_DATE    0x0FFFFFFFU
#define INTERRUPT_CORE0_INTERRUPT_DATE_M  (INTERRUPT_CORE0_INTERRUPT_DATE_V << INTERRUPT_CORE0_INTERRUPT_DATE_S)
#define INTERRUPT_CORE0_INTERRUPT_DATE_V  0x0FFFFFFFU
#define INTERRUPT_CORE0_INTERRUPT_DATE_S  0

#ifdef __cplusplus
}
#endif
